CFD_test_case/DLbuoyantPimpleFoam/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 293.15;
    }
    front
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    bot
    {
        type            zeroGradient;
    }
    obstacle
    {
        type            externalWallHeatFluxTemperature;
        mode            power;
        Q               4500;
        kappaMethod     fluidThermo;
        value           uniform 293.15;
    }
    outlet
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
