CFD_test_case/DLbuoyantPimpleFoam/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (3 0 0);
pressure             1e5;
turbulentKE          0.03375;      // k = 1.5*(U*I)^2 with U=3 m/s, I=5%
turbulentOmega       9.67;

// ************************************************************************* //
