CFD_test_case/DLbuoyantPimpleFoam/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $turbulentKE;
    }
    front
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    bot
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    obstacle
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
    outlet
    {
        type            zeroGradient;
    }
    back
    {
        type            kqRWallFunction;
        value           uniform $turbulentKE;
    }
}


// ************************************************************************* //
