CFD_test_case/DLbuoyantPimpleFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         cellLimited Gauss linear 1;     // Apply limiting to all gradients
    grad(k)         cellLimited Gauss linear 1;
    grad(epsilon)   cellLimited Gauss linear 1;
    grad(omega)     cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss linearUpwind limited;
    turbulence      bounded Gauss limitedLinear 1;
    div(phi,h)      $turbulence;
    div(phi,K)      $turbulence;
    div(phi,k)      $turbulence;
    div(phi,epsilon)$turbulence;
    div(phi,omega)  $turbulence;

    div(phi,T)      Gauss limitedLinear 1;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;         // Use corrected for non-orthogonal meshes
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;                      // Use corrected for surface-normal 
}

wallDist
{
    method          meshWave;
}
// ************************************************************************* //
