CFD_test_case/DLbuoyantPimpleFoam/system/topoSetDict_mid
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    middleRegion;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (0.0 0.0 0.0) (0.35 0.14 0.030000000000000002);
        }
    }
);
